# app/schemas/drug_map_schema.py

from sqlmodel import SQLModel, Field
from app.models.drug_map import DrugMapBase

# ---------------------------------------------------------------------------
# 1. اسکیمای پایه و ورودی برای ایجاد ارتباط (CREATE)
# ---------------------------------------------------------------------------

class DrugMapCreate(DrugMapBase):
    pass

# ---------------------------------------------------------------------------
# 2. اسکیمای خروجی برای نمایش ارتباط (READ)
# ---------------------------------------------------------------------------
class DrugMapRead(DrugMapBase):
    # این اسکیما دقیقاً مانند پایه است چون کلیدهای خارجی خودشان داده‌های اصلی هستند.
    pass

# نکته: اسکیمای آپدیت برای این مدل معنی ندارد، چون برای تغییر یک ارتباط،
# باید رکورد فعلی را حذف و رکورد جدیدی ایجاد کرد.
